{
  "resourceType": "OperationDefinition",
  "id": "find-variants",
  "name": "find-variants",
  "status": "draft",
  "kind": "operation",
  "description": "Use this operation to retrieve variants with precise endpoints from a specified genomic region for a specified patient. If the range in question has been studied, the operation returns a FHIR Genomics report (that may or may not contain any variants). If the patient or the specified region has not been studied, the operation returns a 404 error.",
  "affectsState": false,
  "code": "find-variants",
  "system": true,
  "type": true,
  "instance": true,
  "parameter": [
    {
      "name": "subject",
      "use": "in",
      "min": 1,
      "max": "1",
      "documentation": "The subject of interest.",
      "type": "string",
      "searchType": "reference"
    },
    {
      "name": "region",
      "use": "in",
      "min": 1,
      "max": "1",
      "documentation": "Region of interest is specified as a 0-based integer interval range. Variants that overlap the range are returned. (Note that an insertion that starts before the range, regardless of length, would not overlap the range, and would therefore not be returned).",
      "type": "Range"
    },
    {
      "name": "genomicRefSeq",
      "use": "in",
      "min": 1,
      "max": "1",
      "documentation": "Genomic reference sequence is a valid NCBI chromosome-level ('NC_') build 37 or build 38 identifier, or a valid mitochondrion identifier (NC_012920.1, NC_001807.4).",
      "type": "string",
      "searchType": "token"
    },
    {
      "name": "FHIRGenomicsReport",
      "use": "out",
      "min": 1,
      "max": "1",
      "documentation": "Returned Bundle contains a diagnostic report which contains a single region studied profile, which reflects back the query parameters; zero to many variants found in the region; and zero to many sequence phase relationships between found variants. If the region hasn't been studied, return a 404 response code. ",
      "type": "Bundle"
    }
  ]
}