{
  "package-id": "hl7.fhir.uv.genomics-reporting",
  "title": "Genetic Reporting Implementation Guide",
  "canonical": "http://hl7.org/fhir/uv/genomics-reporting",
  "introduction": "Genomics is a rapidly evolving area of healthcare that involves complex data structures. There is significant value in sharing this information in a way that is consistent, computable and that can accommodate ongoing evolution of medical science and practice.  The value comes from the ability to easily sort, filter and perform decision support on such information and the resulting improvements in care and reduction in costs such as the elimination of redundant testing.  The implementation guide is also transmission protocol-independent - the data structures presented here could be used in RESTful, messaging, document or other paradigms.\r\n\r\nThis guide covers all aspects of human genomic genomics-reporting, including:\r\n\r\n* Representation of simple discrete variants, structural variants including copy number variants, complex variants as well as gross variations such as extra or missing chromosomes\r\n* Representation of both known variants as well as fully describing de novo variations\r\n* Germline and somatic variations\r\n* Relevance of identified variations from the perspective of disease pathology, pharmacogenomics, transplant suitability (e.g. HLA typing), etc.\r\n* Full and partial DNA sequencing, including whole genome and exome studies\r\n* Mosaicism (differing genomic characteristics for different specimens from the same subject)\r\n* Mitochondrial DNA variations\r\n\r\nAt present, this implementation guide focuses solely on data structures - what data should be/might be present and how it should be organized. It does not address workflows around how reports are requested, created, approved, routed, delivered, amended, etc. The implementation guide is also paradigm-independent - the data structures presented here could be used in RESTful, messaging, documents or other mechanisms.",
  "list": [
    {
      "version": "current",
      "desc": "Continuous Integration Build (latest in version control)",
      "path": "http://build.fhir.org/ig/HL7/genomics-reporting",
      "status": "ci-build",
      "current": true
    },
    {
      "version": "1.0.0",
      "date": "2019-11-12",
      "desc": "STU 1",
      "path": "http://hl7.org/fhir/uv/genomics-reporting/",
      "status": "trial-use",
      "sequence": "STU 1",
      "fhirversion": "4.0.1"
    },
    {
      "version": "0.3.0",
      "date": "2018-12-04",
      "desc": "STU 1 Ballot #2",
      "path": "http://hl7.org/fhir/uv/genomics-reporting/2019Jan",
      "status": "ballot",
      "sequence": "STU 1",
      "fhirversion": "3.6.0"
    },
    {
      "version": "0.1.0",
      "date": "2018-04-04",
      "desc": "STU 1 Ballot",
      "path": "http://hl7.org/fhir/uv/genomics-reporting/2018May",
      "status": "ballot",
      "sequence": "STU 1",
      "fhirversion": "3.3.0"
    }
  ]
}
